/******************************************************************************
 *
 * 文件名  ： inno_chain.h
 * 负责人  ： 彭鹏(pengp@innosilicon.com.cn)
 * 创建日期： 20171212
 * 版本号  ： r1.0
 * 文件描述： 实现chain模块
 * 版权说明： Copyright (c) 2000-2020 Innosilicon
 * 其    他： 无
 * 修改日志： 无
 *
 *******************************************************************************/
/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _INNO_CHAIN_H_
#define _INNO_CHAIN_H_

/************************************ 头文件 ***********************************/
#include <stdio.h>
#include <stdint.h>

#include "config.h"
#include "zynq_gpio.h"
#include "zynq_spi.h"
#include "zynq_vid.h"
#include "inno_ax.h"

/************************************ 宏定义 ***********************************/

/*********************************** 类型定义 **********************************/
typedef struct INNO_CHAIN_TAG{
    ZYNQ_SPI_T  spi;        /* 链spi驱动 */

    ZYNQ_GPIO_T power_en;   /* power_en gpio */
    ZYNQ_GPIO_T start_en;   /* start_en gpio */
    ZYNQ_GPIO_T reset;      /* reset gpio */
    ZYNQ_GPIO_T led;        /* led gpio */
    ZYNQ_GPIO_T plug;       /* plug gpio */

    ZYNQ_VID_T  vid;        /* vid 信号 */

    INNO_AX_T   ax[INNO_CONFIG_MAX_CHIP_NUM]; /* 链上的所有芯片 */
    int         chip_num;                     /* 本链的芯片数 */
    int         chain_id;                     /* 在桶上的编号 */
    bool        plugged;                      /* 算力板是否插入 */
    bool        valid;                        /* 链是否有效 */
}INNO_CHAIN_T;

/*--------------------------------- 接口声明区 --------------------------------*/

/*********************************** 全局变量 **********************************/

/*********************************** 接口函数 **********************************/
/*******************************************************************************
 *
 * 函数名  : inno_chain_init
 * 描述    : 初始化链
 * 输入参数: chain    - 链指针
 *           chain_id - 链编号
 *           chip_num - 链上芯片数
 * 输出参数: 无
 * 返回值:   无
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
void inno_chain_init(INNO_CHAIN_T *chain, int chain_id, int chip_num);

/*******************************************************************************
 *
 * 函数名  : inno_chain_exit
 * 描述    : 反初始化链
 * 输入参数: chain    - 链指针
 * 输出参数: 无
 * 返回值:   无
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
void inno_chain_exit(INNO_CHAIN_T *chain);

/*******************************************************************************
 *
 * 函数名  : inno_chain_get_type_bits
 * 描述    : 获取该链算力类型
 * 输入参数: chain - 链指针
 * 输出参数: 无
 * 返回值:   0x00: A5
 *           0x06: A6
 *           0x0b: A7
 *           0x03: A8
 *           其他: 未实现的算力芯片
 *
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
int inno_chain_get_type_bits(INNO_CHAIN_T *chain);

#endif // #ifndef _INNO_CHAIN_H_

