/******************************************************************************
 *
 * 文件名  ： inno_bucket.h
 * 负责人  ： 彭鹏(pengp@innosilicon.com.cn)
 * 创建日期： 20171212
 * 版本号  ： v1.0
 * 文件描述： Innosilicon Ax系列芯片对应的矿机桶(包括单双桶) 接口
 * 版权说明： Copyright (c) 2000-2020 Innosilicon
 * 其    他： 无
 * 修改日志： 无
 *
 *******************************************************************************/
/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _INNO_BUCKET_H_
#define _INNO_BUCKET_H_

/************************************ 头文件 ***********************************/
#include <stdint.h>

#include "config.h"
#include "inno_ax.h"
#include "inno_chain.h"

/************************************ 宏定义 ***********************************/

/*********************************** 类型定义 **********************************/
typedef struct INNO_BUCKET_TAG{
    INNO_CHAIN_T  chain[INNO_CONFIG_MAX_CHAIN_NUM]; /* 矿机桶拥有的链 */
    int           chain_num;                        /* 矿机桶链数 */
}INNO_BUCKET_T;

/*--------------------------------- 接口声明区 --------------------------------*/

/*********************************** 全局变量 **********************************/

/*********************************** 接口函数 **********************************/
/*******************************************************************************
 *
 * 函数名  : inno_bucket_init
 * 描述    : 初始化算力桶
 * 输入参数: bucket    - 桶指针
 *           chain_num - 单通链数
 *           chip_num  - 单链芯片数
 * 输出参数: 无
 * 返回值:   无
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
void inno_bucket_init(INNO_BUCKET_T *bucket, int chain_num, int chip_num);

/*******************************************************************************
 *
 * 函数名  : inno_bucket_exit
 * 描述    : 反初始化算力桶
 * 输入参数: bucket    - 桶指针
 * 输出参数: 无
 * 返回值:   无
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
void inno_bucket_exit(INNO_BUCKET_T *bucket);

/*******************************************************************************
 *
 * 函数名  : inno_bucket_get_type_bits
 * 描述    : 获取算力桶算力类型
 * 输入参数: bucket - 桶指针
 * 输出参数: 无
 * 返回值:   参考inno_chain_get_type_bits函数
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
int inno_bucket_get_type_bits(INNO_BUCKET_T *bucket);

#endif // #ifndef _INNO_BUCKET_H_

