/******************************************************************************
 *
 * 文件名  ： zynq_gpio.h
 * 负责人  ： 王鹏(wangp@innosilicon.com.cn)
 * 创建日期： 20171208
 * 版本号  ： v1.0
 * 文件描述： zynq平台gpio接口
 * 版权说明： Copyright (c) 2000-2020 Innosilicon
 * 其    他： 无
 * 修改日志： 无
 *
 *******************************************************************************/
/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _ZYNQ_GPIO_H_
#define _ZYNQ_GPIO_H_

/************************************ 头文件 ***********************************/
#include <stdio.h>
#include <stdint.h>
#include <pthread.h>

/************************************ 宏定义 ***********************************/

/*********************************** 类型定义 **********************************/
/* zynq gpio 结构体 */
typedef struct ZYNQ_GPIO_TAG{
    int pin;    /* 编号 */
    int val;    /* 高低电平 */
    int dir;    /* 方向, 0出, 1入*/
}ZYNQ_GPIO_T;

/*--------------------------------- 接口声明区 --------------------------------*/

/*********************************** 全局变量 **********************************/

/*********************************** 接口函数 **********************************/
/*******************************************************************************
 *
 * 函数名  : zynq_gpio_init
 * 描述    : 初始化gpio
 * 输入参数: gpio - gpio结构
 *           pin  - gpio编号
 *           dir  - gpio方向
 * 输出参数: 无
 * 返回值:   无
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
extern void zynq_gpio_init(ZYNQ_GPIO_T *gpio, int pin, int dir);

/*******************************************************************************
 *
 * 函数名  : zynq_gpio_exit
 * 描述    : 反初始化gpio
 * 输入参数: gpio - gpio结构
 * 输出参数: 无
 * 返回值:   无
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
extern void zynq_gpio_exit(ZYNQ_GPIO_T *gpio);

/*******************************************************************************
 *
 * 函数名  : zynq_gpio_write
 * 描述    : gpio赋值
 * 输入参数: gpio - gpio结构
 *           val  - gpio值(0,1)
 * 输出参数: 无
 * 返回值:   无
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
extern void zynq_gpio_write(ZYNQ_GPIO_T *gpio, int val);

/*******************************************************************************
 *
 * 函数名  : zynq_gpio_read
 * 描述    : gpio读值
 * 输入参数: gpio - gpio结构
 * 输出参数: 无
 * 返回值:   -1 失败
 *            0 低电平
 *            1 高电平
 *
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
extern int zynq_gpio_read(ZYNQ_GPIO_T *gpio);

/*******************************************************************************
 *
 * 函数名  : zynq_gpio_get_pin_from_chain_id
 * 描述    : 获取一条链的各gpio值
 * 输入参数: chain_id - 链编号
 * 输出参数: power_en - 返回power_en pin编号
 *           start_en - 返回start_en pin编号
 *           reset    - 返回reset pin编号
 *           led      - 返回led pin编号
 *           plug     - 返回plug pin编号
 * 返回值:    0 成功
 *           -1 失败
 *
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
extern int zynq_gpio_get_pin_from_chain_id(int *power_en, int *start_en, int *reset, int *led, int *plug, int chain_id);

#endif // #ifndef _ZYNQ_GPIO_

